; domain
(define (domain hanoi)
(:requirements :strips)
(:predicates (clear ?x)
             (on ?x ?y)
             (smaller ?x ?y))

(:action move
:parameters (?disc ?from ?to)
:precondition (and (smaller ?disc ?to) 
                   (on ?disc ?from) 
                   (clear ?disc) 
                   (clear ?to))
:effect  (and (clear ?from) 
              (on ?disc ?to) 
              (not (on ?disc ?from))  
              (not (clear ?to)))
 ))

; problem
(define (problem hanoi1)
    (:domain hanoi)
    (:objects
        peg1 peg2 peg3
        orange_disk red_disk yellow_disk
    )
    (:init
        (clear red_disk)
        (clear peg2)
        (clear peg3)
        (on red_disk orange_disk)
        (on orange_disk yellow_disk)
        (on yellow_disk peg1)
        (smaller red_disk peg1)
        (smaller orange_disk peg1)
        (smaller yellow_disk peg1)
        (smaller red_disk peg2)
        (smaller orange_disk peg2)
        (smaller yellow_disk peg2)
        (smaller red_disk peg3)
        (smaller orange_disk peg3)
        (smaller yellow_disk peg3)
        (smaller red_disk orange_disk)
        (smaller red_disk yellow_disk)
        (smaller orange_disk yellow_disk)
    )
    (:goal (and (on yellow_disk peg3) (on orange_disk yellow_disk) (on red_disk orange_disk)))
)

; plan
1. (move red_disk orange_disk peg3)
   deleted: (on red_disk orange_disk) (clear peg3)
   added: (clear orange_disk) (on red_disk peg3)
   goals met: 1 of 3
2. (move orange_disk yellow_disk peg2)
   deleted: (on orange_disk yellow_disk) (clear peg2)
   added: (clear yellow_disk) (on orange_disk peg2)
   goals met: 0 of 3
3. (move red_disk peg3 orange_disk)
   deleted: (on red_disk peg3) (clear orange_disk)
   added: (clear peg3) (on red_disk orange_disk)
   goals met: 1 of 3
4. (move yellow_disk peg1 peg3)
   deleted: (on yellow_disk peg1) (clear peg3)
   added: (clear peg1) (on yellow_disk peg3)
   goals met: 2 of 3
5. (move red_disk orange_disk peg1)
   deleted: (on red_disk orange_disk) (clear peg1)
   added: (clear orange_disk) (on red_disk peg1)
   goals met: 1 of 3
6. (move orange_disk peg2 yellow_disk)
   deleted: (on orange_disk peg2) (clear yellow_disk)
   added: (clear peg2) (on orange_disk yellow_disk)
   goals met: 2 of 3
7. (move red_disk peg1 orange_disk)
   deleted: (on red_disk peg1) (clear orange_disk)
   added: (clear peg1) (on red_disk orange_disk)
   goals met: 3 of 3
